In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    'name':['sonu','skg','sanu','abc'],
    'marks':[97,56,23,45],
    'city':['begusarai','bangalore','patna','ranchi']
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

   name  marks       city
0  sonu     97  begusarai
1   skg     56  bangalore
2  sanu     23      patna
3   abc     45     ranchi

In [5]:
df.to_csv('dataset.csv')

In [6]:
df.to_csv('dataset_without_index.csv',index=False)

In [7]:
df.head(2)

   name  marks       city
0  sonu     97  begusarai
1   skg     56  bangalore

In [8]:
df.tail(2)

   name  marks    city
2  sanu     23   patna
3   abc     45  ranchi

In [9]:
df.describe()

           marks
count   4.000000
mean   55.250000
std    31.030899
min    23.000000
25%    39.500000
50%    50.500000
75%    66.250000
max    97.000000

In [10]:
sonu=pd.read_csv('sonu.csv')

In [11]:
sonu

   Unnamed: 0  Unnamed: 0.1   Train no  speed       city
0           0             0    5425875     87  begusarai
1           1             1    6584365     56  bangalore
2           2             2      89664     23      patna
3           3             3  785541111     45     ranchi

In [12]:
sonu['Train no']

0      5425875
1      6584365
2        89664
3    785541111
Name: Train no, dtype: int64

In [13]:
sonu['speed'][0]

87

In [14]:
sonu['speed'][0]=87

<ipython-input-14-2ebb4f4e6194>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sonu['speed'][0]=87

In [15]:
sonu

   Unnamed: 0  Unnamed: 0.1   Train no  speed       city
0           0             0    5425875     87  begusarai
1           1             1    6584365     56  bangalore
2           2             2      89664     23      patna
3           3             3  785541111     45     ranchi

In [16]:
sonu.to_csv('sonu.csv')

In [17]:
sonu.index=['first','second','third','fourth']

In [18]:
sonu

        Unnamed: 0  Unnamed: 0.1   Train no  speed       city
first            0             0    5425875     87  begusarai
second           1             1    6584365     56  bangalore
third            2             2      89664     23      patna
fourth           3             3  785541111     45     ranchi

In [19]:
ser=pd.Series(np.random.rand(34))

In [20]:
ser

0     0.560801
1     0.112870
2     0.060178
3     0.832740
4     0.146815
5     0.543435
6     0.778809
7     0.985482
8     0.711567
9     0.280608
10    0.001767
11    0.060555
12    0.305719
13    0.695618
14    0.045761
15    0.154677
16    0.957413
17    0.569290
18    0.980489
19    0.066272
20    0.475225
21    0.377425
22    0.354953
23    0.947308
24    0.865179
25    0.704035
26    0.546846
27    0.277440
28    0.013937
29    0.714754
30    0.265831
31    0.111311
32    0.776131
33    0.863995
dtype: float64

In [21]:
type(ser)

pandas.core.series.Series

In [22]:
newdf=pd.DataFrame(np.random.rand(330,5),index=np.arange(330))

In [23]:
newdf.head()

          0         1         2         3         4
0  0.530790  0.369813  0.505128  0.154397  0.955319
1  0.564071  0.233865  0.710552  0.744174  0.400230
2  0.632972  0.288505  0.470903  0.435408  0.302599
3  0.932870  0.000115  0.006281  0.095395  0.911571
4  0.643292  0.514469  0.333816  0.890486  0.835087

In [24]:
type(newdf)

pandas.core.frame.DataFrame

In [25]:
newdf.describe()
newdf.head()

          0         1         2         3         4
0  0.530790  0.369813  0.505128  0.154397  0.955319
1  0.564071  0.233865  0.710552  0.744174  0.400230
2  0.632972  0.288505  0.470903  0.435408  0.302599
3  0.932870  0.000115  0.006281  0.095395  0.911571
4  0.643292  0.514469  0.333816  0.890486  0.835087

In [26]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [27]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            320, 321, 322, 323, 324, 325, 326, 327, 328, 329],
           dtype='int64', length=330)

In [28]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [29]:
newdf.to_numpy()

array([[5.30789600e-01, 3.69812584e-01, 5.05128300e-01, 1.54396928e-01,
        9.55319286e-01],
       [5.64071118e-01, 2.33864955e-01, 7.10552376e-01, 7.44174338e-01,
        4.00229564e-01],
       [6.32972128e-01, 2.88504823e-01, 4.70902886e-01, 4.35407920e-01,
        3.02599435e-01],
       ...,
       [3.70316130e-01, 4.72888652e-01, 3.99692764e-01, 2.66014796e-01,
        4.90283387e-01],
       [5.39403011e-04, 8.10563295e-01, 8.98127410e-01, 7.93450267e-01,
        6.68125316e-01],
       [7.81156311e-01, 4.38794581e-01, 6.13265193e-01, 2.10442231e-01,
        8.58667490e-02]])

In [30]:
newdf1=newdf.T

In [31]:
newdf1.index

RangeIndex(start=0, stop=5, step=1)

In [32]:
newdf1.columns

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            320, 321, 322, 323, 324, 325, 326, 327, 328, 329],
           dtype='int64', length=330)

In [33]:
newdf.head()

          0         1         2         3         4
0  0.530790  0.369813  0.505128  0.154397  0.955319
1  0.564071  0.233865  0.710552  0.744174  0.400230
2  0.632972  0.288505  0.470903  0.435408  0.302599
3  0.932870  0.000115  0.006281  0.095395  0.911571
4  0.643292  0.514469  0.333816  0.890486  0.835087

In [34]:
newdf.sort_index(axis=0,ascending=False).head()

            0         1         2         3         4
329  0.781156  0.438795  0.613265  0.210442  0.085867
328  0.000539  0.810563  0.898127  0.793450  0.668125
327  0.370316  0.472889  0.399693  0.266015  0.490283
326  0.881894  0.548482  0.957941  0.605181  0.727049
325  0.726276  0.656670  0.894417  0.181827  0.951023

In [35]:
newdf.sort_index(axis=1,ascending=False).head()

          4         3         2         1         0
0  0.955319  0.154397  0.505128  0.369813  0.530790
1  0.400230  0.744174  0.710552  0.233865  0.564071
2  0.302599  0.435408  0.470903  0.288505  0.632972
3  0.911571  0.095395  0.006281  0.000115  0.932870
4  0.835087  0.890486  0.333816  0.514469  0.643292

In [36]:
type(newdf[0])

pandas.core.series.Series

In [37]:
newdf[1]

0      0.369813
1      0.233865
2      0.288505
3      0.000115
4      0.514469
         ...
325    0.656670
326    0.548482
327    0.472889
328    0.810563
329    0.438795
Name: 1, Length: 330, dtype: float64

In [38]:
newdf

            0         1         2         3         4
0    0.530790  0.369813  0.505128  0.154397  0.955319
1    0.564071  0.233865  0.710552  0.744174  0.400230
2    0.632972  0.288505  0.470903  0.435408  0.302599
3    0.932870  0.000115  0.006281  0.095395  0.911571
4    0.643292  0.514469  0.333816  0.890486  0.835087
..        ...       ...       ...       ...       ...
325  0.726276  0.656670  0.894417  0.181827  0.951023
326  0.881894  0.548482  0.957941  0.605181  0.727049
327  0.370316  0.472889  0.399693  0.266015  0.490283
328  0.000539  0.810563  0.898127  0.793450  0.668125
329  0.781156  0.438795  0.613265  0.210442  0.085867

[330 rows x 5 columns]

In [39]:
newdf2=newdf

In [40]:
newdf2.head()

          0         1         2         3         4
0  0.530790  0.369813  0.505128  0.154397  0.955319
1  0.564071  0.233865  0.710552  0.744174  0.400230
2  0.632972  0.288505  0.470903  0.435408  0.302599
3  0.932870  0.000115  0.006281  0.095395  0.911571
4  0.643292  0.514469  0.333816  0.890486  0.835087

In [41]:
newdf.loc[0,0]=0.3456789

In [42]:
newdf.head(2)

          0         1         2         3         4
0  0.345679  0.369813  0.505128  0.154397  0.955319
1  0.564071  0.233865  0.710552  0.744174  0.400230

In [43]:
newdf.columns=list("ABCDE")

In [44]:
newdf.loc[0,0]=34445

In [45]:
newdf

            A         B         C         D         E        0
0    0.345679  0.369813  0.505128  0.154397  0.955319  34445.0
1    0.564071  0.233865  0.710552  0.744174  0.400230      NaN
2    0.632972  0.288505  0.470903  0.435408  0.302599      NaN
3    0.932870  0.000115  0.006281  0.095395  0.911571      NaN
4    0.643292  0.514469  0.333816  0.890486  0.835087      NaN
..        ...       ...       ...       ...       ...      ...
325  0.726276  0.656670  0.894417  0.181827  0.951023      NaN
326  0.881894  0.548482  0.957941  0.605181  0.727049      NaN
327  0.370316  0.472889  0.399693  0.266015  0.490283      NaN
328  0.000539  0.810563  0.898127  0.793450  0.668125      NaN
329  0.781156  0.438795  0.613265  0.210442  0.085867      NaN

[330 rows x 6 columns]

In [47]:
#newdf.drop((0,0),axis=1)
newdf

            A         B         C         D         E        0
0    0.345679  0.369813  0.505128  0.154397  0.955319  34445.0
1    0.564071  0.233865  0.710552  0.744174  0.400230      NaN
2    0.632972  0.288505  0.470903  0.435408  0.302599      NaN
3    0.932870  0.000115  0.006281  0.095395  0.911571      NaN
4    0.643292  0.514469  0.333816  0.890486  0.835087      NaN
..        ...       ...       ...       ...       ...      ...
325  0.726276  0.656670  0.894417  0.181827  0.951023      NaN
326  0.881894  0.548482  0.957941  0.605181  0.727049      NaN
327  0.370316  0.472889  0.399693  0.266015  0.490283      NaN
328  0.000539  0.810563  0.898127  0.793450  0.668125      NaN
329  0.781156  0.438795  0.613265  0.210442  0.085867      NaN

[330 rows x 6 columns]

In [48]:
type(newdf)

pandas.core.frame.DataFrame

In [50]:
newdf.head()

          A         B         C         D         E        0
0  0.345679  0.369813  0.505128  0.154397  0.955319  34445.0
1  0.564071  0.233865  0.710552  0.744174  0.400230      NaN
2  0.632972  0.288505  0.470903  0.435408  0.302599      NaN
3  0.932870  0.000115  0.006281  0.095395  0.911571      NaN
4  0.643292  0.514469  0.333816  0.890486  0.835087      NaN

In [51]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.710552  0.744174
2  0.470903  0.435408

In [52]:
newdf.loc[:,['C','D']]

            C         D
0    0.505128  0.154397
1    0.710552  0.744174
2    0.470903  0.435408
3    0.006281  0.095395
4    0.333816  0.890486
..        ...       ...
325  0.894417  0.181827
326  0.957941  0.605181
327  0.399693  0.266015
328  0.898127  0.793450
329  0.613265  0.210442

[330 rows x 2 columns]

In [53]:
newdf.loc[[1,2],:]

          A         B         C         D         E   0
1  0.564071  0.233865  0.710552  0.744174  0.400230 NaN
2  0.632972  0.288505  0.470903  0.435408  0.302599 NaN

In [55]:
data=pd.read_csv('movies.csv')

In [56]:
data

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

In [57]:
new_data=data.to_csv('movies_new.csv',index=False)

In [58]:
new_data